In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.arange(10).reshape(5,-1), index = ['user1', 'user2', 'user3', 'user4', 'user5'], columns = ['x','y'])

In [3]:
df1 = pd.DataFrame(np.arange(10).reshape(5,-1), columns = ['x','y'])

In [4]:
df

       x  y
user1  0  1
user2  2  3
user3  4  5
user4  6  7
user5  8  9

In [5]:
df1

   x  y
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [6]:
df.loc['user1':'user3', 'x'] #upper index inclusive

user1    0
user2    2
user3    4
Name: x, dtype: int32

In [7]:
df1.loc[[1,3],['y']]

   y
1  3
3  7

In [8]:
df.iloc[1:4,[0,1]] #can only be accessed using index  
                   #upper index not inclusive

       x  y
user2  2  3
user3  4  5
user4  6  7

In [9]:
df.loc[(df['x'] > 5) & (df['y'] > 5)]  #using loc to get rows with columns > 5

       x  y
user4  6  7
user5  8  9

In [10]:
df[(df['x'] > 5) & (df['y'] > 5)]  # above output without using loc

       x  y
user4  6  7
user5  8  9

In [11]:
#Two ways to access columns
df['x'] 
df.x #ony works if the column name is a single word

user1    0
user2    2
user3    4
user4    6
user5    8
Name: x, dtype: int32

In [12]:
#sorting
df.sort_values('x', ascending = False) #sorted in descending order

       x  y
user5  8  9
user4  6  7
user3  4  5
user2  2  3
user1  0  1

# Filtering Data

## df.query()

In [13]:
df.query('x > 5 and y > 5')  #using .query():expression should be inside inverted commas 
                                            # - treats it as a string

       x  y
user4  6  7
user5  8  9

In [14]:
my_filter1 = df.x > 5             #creating a variable for the filter first for more readability
my_filter2 = df.y > 5
df[my_filter1 & my_filter2]

       x  y
user4  6  7
user5  8  9

##  df.isin()

In [15]:
my_filter = [0,2,4]
df[df['x'].isin(my_filter)]   #using .isin() : Whether each element in the 
                                           # DataFrame or its column contains the given values

       x  y
user1  0  1
user2  2  3
user3  4  5

In [24]:
people = {
    "first": ["Lorem", "John", "Jane"],
    "last": ["Ipsum", "Doe", "Doe"],
    "email": ["lorem@yahoo.com", "john@gmail.com", "jane@outlook.com"],
}
df3 = pd.DataFrame(people)
df3

   first   last             email
0  Lorem  Ipsum   lorem@yahoo.com
1   John    Doe    john@gmail.com
2   Jane    Doe  jane@outlook.com

## df.str.contains()

In [25]:
# Create a filter of people having the email of provider of
# gmail
email_filt = df3['email'].str.contains("gmail.com", na=False)
df3[email_filt]

  first last           email
1  John  Doe  john@gmail.com